src/test/resources/xmls/AssessmentUpdates/GeneratedSampleFromOasys.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:cms="http://www.hp.com/NDH_Web_Service/CMSUpdate" xmlns:dom="http://www.hp.com/NDH_Web_Service/DomainTypes" xmlns:ass="http://www.hp.com/NDH_Web_Service/assessmentsummary">
    <soap:Header/>
    <soap:Body>
        <cms:CMSUpdate>
            <cms:Header>
                <dom:ApplicationMode>?</dom:ApplicationMode>
                <dom:CorrelationID>?</dom:CorrelationID>
                <dom:OASysRUsername>?</dom:OASysRUsername>
                <dom:MessageTimestamp>?</dom:MessageTimestamp>
            </cms:Header>
            <cms:Assessment>
                <ass:CMSProbNumber>?</ass:CMSProbNumber>
                <!--You have a CHOICE of the next 2 items at this level-->
                <ass:EventNumber>?</ass:EventNumber>
                <ass:ICMSReference>
                    <dom:RefClient>?</dom:RefClient>
                    <dom:RefLink>?</dom:RefLink>
                    <dom:RefSupervision>?</dom:RefSupervision>
                </ass:ICMSReference>
                <ass:OffenderGUID>?</ass:OffenderGUID>
                <!--Optional:-->
                <ass:DateAssessmentCompleted>?</ass:DateAssessmentCompleted>
                <!--Optional:-->
                <ass:DeletedIndicator>?</ass:DeletedIndicator>
                <ass:AssessmentGUID>?</ass:AssessmentGUID>
                <!--Optional:-->
                <ass:RiskFlags>?</ass:RiskFlags>
                <!--Optional:-->
                <ass:ConcernFlags>?</ass:ConcernFlags>
                <!--Optional:-->
                <ass:TotalScore>?</ass:TotalScore>
                <!--Optional:-->
                <ass:PurposeOfAssessmentCode>?</ass:PurposeOfAssessmentCode>
                <!--Optional:-->
                <ass:PurposeOfAssessmentDescription>?</ass:PurposeOfAssessmentDescription>
                <ass:DateCreated>?</ass:DateCreated>
                <!--Optional:-->
                <ass:AssessedBy>?</ass:AssessedBy>
                <!--Optional:-->
                <ass:CourtCode>?</ass:CourtCode>
                <!--Optional:-->
                <ass:CourtType>?</ass:CourtType>
                <!--Optional:-->
                <ass:CourtName>?</ass:CourtName>
                <!--Optional:-->
                <ass:Offence>
                    <!--Optional:-->
                    <dom:OffenceGroupCode>?</dom:OffenceGroupCode>
                    <!--Optional:-->
                    <dom:OffenceSubCode>?</dom:OffenceSubCode>
                    <!--Optional:-->
                    <dom:AdditionalIndicator>?</dom:AdditionalIndicator>
                </ass:Offence>
                <!--Optional:-->
                <ass:OGRSScore1>?</ass:OGRSScore1>
                <!--Optional:-->
                <ass:OGRSScore2>?</ass:OGRSScore2>
                <!--Optional:-->
                <ass:SentencePlanInitialDate>?</ass:SentencePlanInitialDate>
                <!--Optional:-->
                <ass:SentencePlanReviewDate>?</ass:SentencePlanReviewDate>
                <!--Optional:-->
                <ass:ReviewTerminated>?</ass:ReviewTerminated>
                <!--Optional:-->
                <ass:ReviewNumber>?</ass:ReviewNumber>
                <!--Optional:-->
                <ass:OGPNotCalculated>?</ass:OGPNotCalculated>
                <!--Optional:-->
                <ass:OVPNotCalculated>?</ass:OVPNotCalculated>
                <!--Optional:-->
                <ass:OGPScore1>?</ass:OGPScore1>
                <!--Optional:-->
                <ass:OGPScore2>?</ass:OGPScore2>
                <!--Optional:-->
                <ass:OVPScore1>?</ass:OVPScore1>
                <!--Optional:-->
                <ass:OVPScore2>?</ass:OVPScore2>
                <!--Optional:-->
                <ass:OGRSRiskRecon>?</ass:OGRSRiskRecon>
                <!--Optional:-->
                <ass:OGPRiskRecon>?</ass:OGPRiskRecon>
                <!--Optional:-->
                <ass:OVPRiskRecon>?</ass:OVPRiskRecon>
                <ass:LayerType>?</ass:LayerType>
                <!--Optional:-->
                <ass:Section3CrimScore>?</ass:Section3CrimScore>
                <!--Optional:-->
                <ass:Section4CrimScore>?</ass:Section4CrimScore>
                <!--Optional:-->
                <ass:Section6CrimScore>?</ass:Section6CrimScore>
                <!--Optional:-->
                <ass:Section7CrimScore>?</ass:Section7CrimScore>
                <!--Optional:-->
                <ass:Section8CrimScore>?</ass:Section8CrimScore>
                <!--Optional:-->
                <ass:Section9CrimScore>?</ass:Section9CrimScore>
                <!--Optional:-->
                <ass:Section11CrimScore>?</ass:Section11CrimScore>
                <!--Optional:-->
                <ass:Section12CrimScore>?</ass:Section12CrimScore>
                <!--Optional:-->
                <ass:LAOIndicator>?</ass:LAOIndicator>
                <!--Optional:-->
                <ass:TierCode>?</ass:TierCode>
                <!--Optional:-->
                <ass:Layer1Obj>?</ass:Layer1Obj>
                <!--Optional:-->
                <ass:Risk>
                    <dom:RiskofHarm>?</dom:RiskofHarm>
                </ass:Risk>
            </cms:Assessment>
            <!--Zero or more repetitions:-->
            <cms:Objective>
                <ass:ObjectiveDescription>objective1</ass:ObjectiveDescription>
                <ass:ObjectiveStatus>?</ass:ObjectiveStatus>
                <!--Optional:-->
                <ass:ObjectiveNumber>?</ass:ObjectiveNumber>
                <!--Optional:-->
                <ass:Need1>?</ass:Need1>
                <!--Optional:-->
                <ass:Need2>?</ass:Need2>
                <!--Optional:-->
                <ass:Need3>?</ass:Need3>
                <!--Optional:-->
                <ass:Need4>?</ass:Need4>
                <!--Optional:-->
                <ass:ActionCode1>?</ass:ActionCode1>
                <!--Optional:-->
                <ass:ActionText1>?</ass:ActionText1>
                <!--Optional:-->
                <ass:ActionCode2>?</ass:ActionCode2>
                <!--Optional:-->
                <ass:ActionText2>?</ass:ActionText2>
                <!--Optional:-->
                <ass:ActionCode3>?</ass:ActionCode3>
                <!--Optional:-->
                <ass:ActionText3>?</ass:ActionText3>
            </cms:Objective>
            <cms:Objective>
                <ass:ObjectiveDescription>objective2</ass:ObjectiveDescription>
                <ass:ObjectiveStatus>?</ass:ObjectiveStatus>
                <!--Optional:-->
                <ass:ObjectiveNumber>?</ass:ObjectiveNumber>
                <!--Optional:-->
                <ass:Need1>?</ass:Need1>
                <!--Optional:-->
                <ass:Need2>?</ass:Need2>
                <!--Optional:-->
                <ass:Need3>?</ass:Need3>
                <!--Optional:-->
                <ass:Need4>?</ass:Need4>
                <!--Optional:-->
                <ass:ActionCode1>?</ass:ActionCode1>
                <!--Optional:-->
                <ass:ActionText1>?</ass:ActionText1>
                <!--Optional:-->
                <ass:ActionCode2>?</ass:ActionCode2>
                <!--Optional:-->
                <ass:ActionText2>?</ass:ActionText2>
                <!--Optional:-->
                <ass:ActionCode3>?</ass:ActionCode3>
                <!--Optional:-->
                <ass:ActionText3>?</ass:ActionText3>
            </cms:Objective>

        </cms:CMSUpdate>
    </soap:Body>
</soap:Envelope>